app/controllers/guests_controller.rb

  def index
     @guests = Guest.all(:order => "created_at DESC")
---
SELECT * FROM `guests` ORDER BY created_at DESC

  def show
    @guest = Guest.find(params[:id])
---
SELECT * FROM `guests` WHERE (`guests`.`id` = 0)

  def edit
    @guest = Guest.find(params[:id])
---
SELECT * FROM `guests` WHERE (`guests`.`id` = 1)

  def create
    @guest = Guest.new(params[:guest])

    respond_to do |format|
      if @guest.save
---
INSERT INTO `guests` (`name`, `fs1`, `fs2`, `fs3`, `fs4`, `w2`, `w3`, `ff1`, `t1`, `t2`, `t3`, `ff3`, `ff2`, `created_at`, `s1`, `s2`, `s3`, `s4`, `f1`, `f2`, `f3`, `fw1`, `fw2`, `fw3`, `ft1`, `ft2`, `ft3`, `updated_at`, `veg`) VALUES('J͚̍̎ͥ͆̽̊Ā̮͔̲͍̘̊̋̎̎̊ͅC̟̯̮̼̟͐ͦ́͞ͅO͖̜̺̻̾̒ͤͦ̓͋B͉̞͉̝͇̒̑', 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, '2013-07-03 02:59:09', 0, 1, 1, 1, 0, 0, 0, NULL, NULL, 0, 0, 0, 0, '2013-07-03 02:59:09', 0)

  def update
    @guest = Guest.find(params[:id])

    respond_to do |format|
      if @guest.update_attributes(params[:guest])
---
SELECT * FROM `guests` WHERE (`guests`.`id` = 2)
UPDATE `guests` SET `f1` = 1, `veg` = 1, `name` = 'Dave', `s4` = 1, `ff3` = 1, `s1` = 1, `f3` = 1, `s3` = 1, `t3` = 1, `f2` = 1, `updated_at` = '2013-06-26 04:23:49', `s2` = 1, `t2` = 1 WHERE `id` = 1

  def destroy
    @guest = Guest.find(params[:id])
    @guest.destroy
---
SELECT * FROM `guests` WHERE (`guests`.`id` = 10)
DELETE FROM `guests` WHERE `id` = 10