app/controllers/statics_controller.rb

  def index
    @statics = Static.all
---
SELECT * FROM `statics`

  def show
    @static = Static.find(params[:id])
---
SELECT * FROM `statics` WHERE (`statics`.`id` = 0)